{"keras_version": "1.2.0", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 3], "name": "input_1", "input_dtype": "float32", "sparse": false}}, {"class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0]]], "name": "lambda_1", "config": {"trainable": true, "batch_input_shape": [null, 64, 64, 3], "output_shape": [64, 64, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bS)\u0002N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\nmodel44.py\u00da\b<lambda>\u0095\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "convolution2d_1", "config": {"activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_1", "nb_filter": 24, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "bias": true, "nb_row": 5, "border_mode": "valid", "W_constraint": null, "subsample": [2, 2]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_1", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_1", "momentum": 0.99, "mode": 0}}, {"class_name": "ELU", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "elu_1", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_1", 0, 0]]], "name": "convolution2d_2", "config": {"activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_2", "nb_filter": 36, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "bias": true, "nb_row": 5, "border_mode": "valid", "W_constraint": null, "subsample": [2, 2]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_2", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_2", "momentum": 0.99, "mode": 0}}, {"class_name": "ELU", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "elu_2", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_2", 0, 0]]], "name": "convolution2d_3", "config": {"activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_3", "nb_filter": 48, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "bias": true, "nb_row": 5, "border_mode": "valid", "W_constraint": null, "subsample": [2, 2]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "batchnormalization_3", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_3", "momentum": 0.99, "mode": 0}}, {"class_name": "ELU", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "elu_3", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_3", 0, 0]]], "name": "convolution2d_4", "config": {"activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "name": "convolution2d_4", "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "bias": true, "nb_row": 3, "border_mode": "valid", "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_4", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_4", "momentum": 0.99, "mode": 0}}, {"class_name": "ELU", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "elu_4", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"batch_input_shape": [null, 1], "name": "input_2", "input_dtype": "float32", "sparse": false}}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_4", 0, 0]]], "name": "convolution2d_5", "config": {"activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "name": "convolution2d_5", "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "bias": true, "nb_row": 3, "border_mode": "valid", "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Lambda", "inbound_nodes": [[["input_2", 0, 0]]], "name": "lambda_2", "config": {"trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bS)\u0002N\u00e7q=\n\u00d7\u00a30>@\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\nmodel44.py\u00da\b<lambda>\u00c1\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_2", "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Flatten", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "inbound_nodes": [[["lambda_2", 0, 0]]], "name": "dense_1", "config": {"activation": "linear", "b_regularizer": null, "input_dim": 1, "activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "output_dim": 16, "b_constraint": null, "W_constraint": null}}, {"class_name": "Merge", "inbound_nodes": [[["flatten_1", 0, 0], ["dense_1", 0, 0]]], "name": "merge_1", "config": {"output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "dot_axes": -1, "mode_type": "raw", "output_mask": null, "arguments": {}, "name": "merge_1", "output_mask_type": "raw", "mode": "concat"}}, {"class_name": "Dense", "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dense_3", "config": {"activation": "linear", "b_regularizer": null, "input_dim": 80, "activity_regularizer": null, "name": "dense_3", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "output_dim": 50, "b_constraint": null, "W_constraint": null}}, {"class_name": "ELU", "inbound_nodes": [[["dense_3", 0, 0]]], "name": "elu_6", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_6", 0, 0]]], "name": "dropout_2", "config": {"trainable": true, "p": 0.8, "name": "dropout_2"}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_4", "config": {"activation": "linear", "b_regularizer": null, "input_dim": 50, "activity_regularizer": null, "name": "dense_4", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "output_dim": 10, "b_constraint": null, "W_constraint": null}}, {"class_name": "ELU", "inbound_nodes": [[["dense_4", 0, 0]]], "name": "elu_7", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "inbound_nodes": [[["elu_7", 0, 0]]], "name": "dense_5", "config": {"activation": "linear", "b_regularizer": null, "input_dim": 10, "activity_regularizer": null, "name": "dense_5", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "output_dim": 1, "b_constraint": null, "W_constraint": null}}, {"class_name": "Lambda", "inbound_nodes": [[["dense_5", 0, 0]]], "name": "lambda_3", "config": {"trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0014S)\u0002N\u00e7\u0000\u0000\u0000\u0000\u0000\u00009@\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\nmodel44.py\u00da\b<lambda>\u00d8\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_3", "output_shape_type": "raw", "function_type": "lambda"}}], "name": "model_1", "output_layers": [["lambda_3", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}}